# Python for Data Analysis
    
    AUTHOR: Dr. Wes McKinney

### Chapter 6: Data Loading, Storage, And File Formats
### **6.4 Interacting with Databases**

In [ ]:
# from google.colab import drive
# drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [1]:
import os
DIR = "C:\Coding\Masters\DataScience\Semana 3"
os.chdir(DIR)

In [2]:
import sqlite3

query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""

con = sqlite3.connect('mydata.sqlite')
con.execute(query)
con.commit()

In [3]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = 'INSERT INTO test VALUES(?, ?, ?, ?)'

con.executemany(stmt, data)
con.commit()

In [4]:
cursor = con.execute('SELECT * FROM test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [5]:
import pandas as pd
cursor.description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [6]:
import sqlalchemy as sqla

db = sqla.create_engine('sqlite:///mydata.sqlite')
conn = db.connect()

query = sqla.text('SELECT * FROM test')
pd.read_sql(query, conn)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [8]:
!rm mydata.sqlite

"rm" no se reconoce como un comando interno o externo,
programa o archivo por lotes ejecutable.